БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>Skype</name>
      <description>Skype</description>
    </items>
    <items>
      <name>АдресИностранный</name>
      <description>Адрес за пределами РФ</description>
    </items>
    <items>
      <name>АдресМестаРождения</name>
      <description>Адрес места рождения</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыДомашний</name>
      <description>Адрес электронной почты (личный)</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыРабочий</name>
      <description>Адрес электронной почты (рабочий)</description>
    </items>
    <items>
      <name>ВебСтраницаОрганизации</name>
      <description>Веб-страница организации</description>
    </items>
    <items>
      <name>ТелефонДомашний</name>
      <description>Домашний телефон</description>
    </items>
    <items>
      <name>ВебСтраницаФизЛица</name>
      <description>Домашняя веб-страница</description>
    </items>
    <items>
      <name>НомерПрочий</name>
      <description>Номер прочий</description>
    </items>
    <items>
      <name>АдресПочтовый</name>
      <description>Почтовый адрес</description>
    </items>
    <items>
      <name>ПрочаяИнформация</name>
      <description>Прочая информация</description>
    </items>
    <items>
      <name>ТелефонРабочий</name>
      <description>Рабочий телефон</description>
    </items>
    <items>
      <name>ТелефонСотовый</name>
      <description>Сотовый телефон</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ТелефонОрганизации</name>
      <description>Телефон организации</description>
    </items>
    <items>
      <name>Факс</name>
      <description>Факс</description>
    </items>
    <items>
      <name>АдресФактический</name>
      <description>Фактический адрес</description>
    </items>
    <items>
      <name>АдресЮридический</name>
      <description>Юридический адрес (адрес регистрации)</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <comment>Тип контактной информации</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМаскуВвода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаВводаТелефонногоНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <comment>Не используется</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <comment>Не используется</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактируетсяВФормеОбъекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/CommonModules/МедицинскаяОтчетностьПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает сведения об организации.
//
// Параметры:
//   Организация       - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//   ДатаЗначения      - Дата - дата, на которую нужно получить сведения.
//   СписокПоказателей - СписокЗначений - список показателей, значения которых нужно вернуть.
//  
// Возвращаемое значение:
//   Структура - структура с ключами из списка показателей и возвращаемыми значениями.
//
Функция ПолучитьСведенияОбОрганизации(Знач Филиал, Знач ДатаЗначения = Неопределено, Знач СписокПоказателей = Неопределено) Экспорт
	
	Перем ОргСведения;
	Перем Значение;
	
	// Структура, в которой будут возвращаться найденные значения
	ОргСведения = Новый Структура;
	
	Если ДатаЗначения = Неопределено Тогда
		ДатаЗначения = ТекущаяДатаСеанса();
	КонецЕсли;
	ДатаЗначения = КонецДня(ДатаЗначения);
	
	ПустаяДата = '00010101000000';
	ПустойАдрес = ",,,,,,,,,";
	
	ЭтоМассив = (ТипЗнч(СписокПоказателей) = Тип("Массив"));
	
	ОтветственныеЛица = Новый Структура;	
	РеквизитыОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(Филиал, ДатаЗначения);
	
	Для Каждого Показатель Из СписокПоказателей Цикл

		ИмяПоказателя = ?(ЭтоМассив, Показатель, Показатель.Представление);
		
		Если ИмяПоказателя = "ИННЮЛ" Тогда
			
			Значение = РеквизитыОрганизации.ИНН;
			
		ИначеЕсли ИмяПоказателя = "КППЮЛ" Тогда
			
			Значение = РеквизитыОрганизации.КПП;
			
		ИначеЕсли ИмяПоказателя = "АдрПочт" Тогда
			
			Значение = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(Филиал.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
			
		ИначеЕсли ИмяПоказателя = "ТелОрганизации" Тогда
			
			Значение = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(Филиал.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
			
		ИначеЕсли ИмяПоказателя = "ФИОРук" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "ФИОБух" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "НаимЮЛПол" Тогда
			
			Значение = РеквизитыОрганизации.НазваниеОрганизации;
			
		КонецЕсли;	
	
		ОргСведения.Вставить(ИмяПоказателя, Значение);
		
	КонецЦикла;
	
	Возврат ОргСведения;
	
КонецФункции

#Область Автозаполнение // Процедуры и функции механизма автоматического заполнения.

// Функция возвращает структуру показателей.
// Ключ структуры - идентификатор показателя.
// Значение структуры – массив из трех элементов:
// 	- признак автозаполнения показателя;
//  - признак расшифровки показателя;
//  - признак запрета редактирования показателя.
//
// Параметры:
// 	 ИДОтчета         - Строка - идентификатор отчета.
//	 ИДРедакцииОтчета - Строка - идентификатор редакции формы отчета.
//   ПараметрыОтчета  - Структура - структура параметров отчета.
//
// Возвращаемое значение:
//   Структура - показатели отчета.
//
Функция ПолучитьСведенияОПоказателяхОтчета(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета = Неопределено) Экспорт
	
	ПоказателиОтчета = Новый Структура;
	
	Возврат ПоказателиОтчета;
	
КонецФункции

// Процедура заполняет переданную в виде контейнера структуру данных отчета.
//
// Параметры:
//   ИДОтчета - Строка - имя регл. отчета.
//   ИДРедакцииОтчета - Строка - имя формы регл. отчета.
//   ПараметрыОтчета - Структура - параметры регл. отчета.
//   Контейнер - Структура - данные регл. отчета.
//
Процедура ЗаполнитьОтчет(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер) Экспорт
	
	Попытка
		Отчеты[ИДОтчета].ЗаполнитьОтчет(ПараметрыОтчета, Контейнер);
	Исключение КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

// Возвращает условный идентификатор конфигурации.
//
// Возвращаемое значение:
//   Строка - идентификатор конфигурации.
//
Функция ИДКонфигурации() Экспорт
	
	Возврат "BITMEDIC";
	
КонецФункции

#Область НоваяФормаМедицинскойОтчетности

// Процедура переопределяет параметры отчета
//
// Параметры:
//  Отчет                      - Структура("Наименование,ПолноеИмя,Ссылка").
//  ОрганизацияОтчета          - Ссылка или Неопределено, организация отчета.
//  ДатаНачалаПериодаОтчета    - Дата или Неопределено, дата начала периода отчета.
//  ДатаОкончанияПериодаОтчета - Дата или Неопределено, дата окончания периода отчета.
//  ПараметрыОткрытия          - Структура, переопределяемые параметры открытия формы отчета.
//
Процедура ПереопределитьПараметрыОтчета(Отчет, ОрганизацияОтчета, ДатаНачалаПериодаОтчета, ДатаОкончанияПериодаОтчета, ПараметрыОткрытия) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Дополняет функционал обработчика "ПриСозданииНаСервере" общей формы "Медицинская отчетность",
// здесь можно добавлять новые конопки в командные панели, расширять возможности интерфейса.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения, общая форма "Медицинская отчетность".
//
// Пример:
//  ГруппаКоманды = Форма.Элементы["ОтчетыГруппа3"];
//  
//  ИмяКоманды = "ОтчетыПоказатьДополнительнуюИнформацию";
//  Команда = Форма.Команды.Добавить(ИмяКоманды);
//  Команда.Подсказка = НСтр("ru = 'Показать дополнительную информацию'");
//  Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
//  Команда.Картинка = БиблиотекаКартинок.Лупа;
//  Команда.Действие = "Подключаемый_ВыполнитьНазначаемуюКоманду";
//  
//  Кнопка = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаКоманды);
//  Кнопка.Заголовок = НСтр("ru = 'Инфо'");
//  Команда.ИзменяетСохраняемыеДанные = Ложь;
//  Кнопка.ИмяКоманды = ИмяКоманды;
//
Процедура ФормаМедицинскойОтчетности_ПриСозданииНаСервере(Форма) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

// Дополняет функционал обработчика "ПриСозданииНаСервере" формы списка справочника "Медицинские отчеты",
// здесь можно инициализировать переменные, расширять возможности интерфейса.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма списка справочника "Медицинские отчеты".
//
// Пример реализации:
//
//  ОтчетыВходяшиеВРасширенныйФункционал = Новый СписокЗначений;
//  ПолучитьСписокОтчетовИУведомленийВходяшихВРасширенныйФункционал(ОтчетыВходяшиеВРасширенныйФункционал);
//  
//  Для Каждого ЭлементСписка Из ОтчетыВходяшиеВРасширенныйФункционал Цикл
//  	Если ТипЗнч(ЭлементСписка.Значение) = Тип("Строка") Тогда
//  		
//  		Форма.Ограничения.Добавить(ЭлементСписка.Представление);
//  		
//  	КонецЕсли;
//  КонецЦикла;
//
Процедура СправочникМедицинскиеОтчеты_ПриСозданииНаСервере(Форма) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти
